app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `email` = 'ursulanielsen@gmail.com'
 LIMIT 1
---
    public function index()
    {
        $data = [];
        helper(['form']);

        if($this->request->getMethod() == 'post') {
            //validation
            $rules = [
                'email' => 'required|min_length[6]|max_length[50]|valid_email',
                'password' => 'required|min_length[8]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => 'Email or Password don\'t match'
                ]
            ];

            if (! $this->validate($rules, $errors)) {
                $data['validation'] = $this->validator;
            }else{
                $model = new UserModel();

                $user = $model->where('email', $this->request->getVar('email'))
                              ->first();

INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`) VALUES ('Ursula', 'Nielsen', 'ursulanielsen@gmail.com', '$2y$10$ltM7s.yCubBU1Qtu.5oe/uJBOWtLKIo4Fqror80LeYQNLE9Bf92Bi')
---
    public function register(){
        $data = [];
        helper(['form']);

        if($this->request->getMethod() == 'post') {
            //validation
            $rules = [
                'firstname' => 'required|min_length[3]|max_length[20]',
                'lastname' => 'required|min_length[3]|max_length[20]',
                'email' => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[8]|max_length[255]',
                'password_confirm' => 'matches[password]',
            ];

            if (! $this->validate($rules)) {
                $data['validation'] = $this->validator;
            }else{
                $model = new UserModel();

                $newData = [
                    'firstname' => $this->request->getVar('firstname'),
                    'lastname' => $this->request->getVar('lastname'),
                    'email' => $this->request->getVar('email'),
                    'password' => $this->request->getVar('password'),
                ];
                $model->save($newData);

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
            }
        }

    $data['user'] = $model->where('id', session()->get('id'))->first();